# id поста с которого считываються эмодзи
POST_ID = 671113687242637335

# id голосового канала
TC_ID = 533529760823771155

# список ролей для выдачи по реакции
ROLES = {
    '🔷': 671111695682371594,  # Blue
    '💚': 671111801542541352,  # Green
    '🍥': 671111841434566666,  # Pink
    '🔴': 671111888242868268,  # Red
    '🟨': 671121876319338501,  # Gold
    '<a:BlurpleKek:671842205706747914>': 672144298036428839,
    '<:BlurpleKek:671842205706747914>': 672144298036428839,
    '<a:cwaddles:671842273558003737>': 672144387895066676,
    '<:cwaddles:671842273558003737>': 672144387895066676,
    '<a:98ff145f1fd745d1898275c03cce1299:671843387384660001>': 672144776904310790,
    '<:98ff145f1fd745d1898275c03cce1299:671843387384660001>': 672144776904310790,
    '<a:rainbowLoli:671843385648218129>': 672144886677372938,
    '<:rainbowLoli:671843385648218129>': 672144886677372938,
    '<a:8371_BMObounce:671843818529751083>': 672145064129986570,
    '<:8371_BMObounce:671843818529751083>': 672145064129986570,
    '🦅': 728358214466273329,


}

# список ролей не учитывающихся при подсчете
# максимального кол-ва ролей у пользователя для смены ника
EXCROLES = (

    666098796593283103,  # server booster
    # ●▬▬▬●Technical Team●▬▬▬●
    729998201855279124,  # Technician
    729930756427612230,  # Dabbler
    # ●▬▬▬●Administration●▬▬▬●
    532907877426266112,  # Administration
    # ●▬▬▬●Moderation●▬▬▬●
    729999011183853609,  # Moderation
    # ●▬▬▬●Belonging●▬▬▬●
    728337692949086270,  # 🌌CHAOS🌌
    729927242062364772,  # 👾Chaos Gods👾
    729926800540434525,  # 🎆Daemon Princes🎆- Ⅰ
    728358214466273329,  # 🦅IMPERIUM OF MAN🦅
    728498475616174111,  # 👑The Emperor👑
    729721473991704686,  # ⚔️Primarchs⚔️- Ⅰ
    728504682212753420,  # ⚜️Adeptus Custodes⚜️- Ⅰ
    728514386167332874,  # 🔱Adeptas Sororitas🔱- Ⅱ
    728500297944793129,  # ✟Inquisition✟
    # ●▬▬▬●Punishment●▬▬▬●
    528919607457873930,  # Mute

)

# ограничение максимального количества ролей (смена цвета ника) для пользователя
MAX_ROLES_PER_USER = 1
