# id поста с которого считываються эмодзи
POST_ID = 671113687242637335

# id голосового канала
TC_ID = 533529760823771155

# список ролей для выдачи по реакции
ROLES = {
    # ●▬▬▬●Colour●▬▬▬●
    '<:blackdeer:751516520357560380>':  746063417818873876,
    '<:purpledeer:751510717974315025>': 672144387895066676,
    '<:browndeer:751513807318155275>':  672144776904310790,
    '<:greendeer:751500818439602256>':  672144886677372938,
    '<:bluedeer:751506222435532951>':   672144298036428839,
    '<:reddeer:751508017165631559>':    672145064129986570,
    '<:yellowdeer:751509813858533507>': 751688699330429010,
    '<:vulpes:751495246583562240>':     751689808748871700,
    '<:silverdeer:751507218712756346>': 751690448757587968,
    '<:pinkdeer:751501537741766816>':   751690701364002836,
    '<:aquadeer:751502091574313060>':   751771611912470539,

    # ●▬▬▬●Belonging●▬▬▬●
    '🦅': 728358214466273329,
    '🌌': 728337692949086270,

}

stik_ONLINE = '▬▬▬▬▬▬▬▬▬▬▬▬ONLINE▬▬▬▬▬▬▬▬▬▬▬▬▬'
stik_MEMBERS_COUNT = '▬▬▬▬▬▬▬▬▬▬MEMBER▬COUNT▬▬▬▬▬▬▬▬▬▬'
stik_SERVER = '▬▬▬▬▬▬▬▬СТАТУС▬СЕРВЕРА▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ OSYPArty ▬▬▬▬▬▬▬▬▬▬'

# список ролей не учитывающихся при подсчете
# максимального кол-ва ролей у пользователя для смены ника
EXCROLES_for_color = (

    666098796593283103,  # server booster
    741889927389773855, # OSY
    728333822315331654, # ●▬▬▬●Technical Team●▬▬▬●
    729998201855279124,  # Technician
    729930756427612230,  # Dabbler
    728351743355912203, # ●▬▬▬●Administration●▬▬▬●
    532907877426266112,  # Administration
    728354110423826443, # ●▬▬▬●Moderation●▬▬▬●
    729999011183853609,  # Moderation
    729999851533893662, # ●▬▬▬●Belonging●▬▬▬●
    728337692949086270,  # 🌌CHAOS🌌
    729927242062364772,  # 👾Chaos Gods👾
    729926800540434525,  # 🎆Daemon Princes🎆- Ⅰ
    728358214466273329,  # 🦅IMPERIUM OF MAN🦅
    728498475616174111,  # 👑The Emperor👑
    729721473991704686,  # ⚔️Primarchs⚔️- Ⅰ
    728504682212753420,  # ⚜️Adeptus Custodes⚜️- Ⅰ
    728514386167332874,  # 🔱Adeptas Sororitas🔱- Ⅱ
    728500297944793129,  # ✟Inquisition✟
    # ●▬▬▬●Punishment●▬▬▬●
    528919607457873930,  # Mute
    730000964118904835, # ●▬▬▬●Colour●▬▬▬●
    729720417438269480, #слуги
    741744217956679702, #●▬▬▬●Other●▬▬▬●
    741896010409967789, #🎶DJ🎶

)

EXCROLES_for_alliance= (

    666098796593283103,  # server booster
    741889927389773855, # OSY
    728333822315331654, # ●▬▬▬●Technical Team●▬▬▬●
    729998201855279124,  # Technician
    729930756427612230,  # Dabbler
    728351743355912203, # ●▬▬▬●Administration●▬▬▬●
    532907877426266112,  # Administration
    728354110423826443, # ●▬▬▬●Moderation●▬▬▬●
    729999011183853609,  # Moderation
    730000964118904835, # ●▬▬▬●Colour●▬▬▬●
    672145064129986570,  # ❤️Красный❤️
    672144886677372938,  # 💚Зелёный💚
    672144387895066676,  # 💜Фиолетовый💜
    672144776904310790,  # 🤎Коричневый🤎
    672144298036428839,  # 💙Синий💙
    746063417818873876,  # 🖤Black🖤
    751689808748871700,  #🧡Оранжевый🧡
    751690448757587968,  #🤍Белый🤍
    751690701364002836,  #💗Розовый💗
    751688699330429010,  #💛Желтый💛
    751771611912470539,  #💎Бирюзовый💎
    # ●▬▬▬●Punishment●▬▬▬●
    528919607457873930,  # Mute
    729999851533893662, # ●▬▬▬●Belonging●▬▬▬●
    729720417438269480, #слуги
    741744217956679702, #●▬▬▬●Other●▬▬▬●
    741896010409967789, #🎶DJ🎶
    


)
Colors_emoji = (
    '<:reddeer:751508017165631559>', # красный
    '<:greendeer:751500818439602256>', #Зелёный
    '<:purpledeer:751510717974315025>', #Фиолетовый
    '<:browndeer:751513807318155275>', #Коричневый
    '<:bluedeer:751506222435532951>', #Синий
    '<:blackdeer:751516520357560380>', #Black
    '<:yellowdeer:751509813858533507>', # желтый
    '<:vulpes:751495246583562240>', # оранжевый
    '<:silverdeer:751507218712756346>', # белый
    '<:pinkdeer:751501537741766816>', # розовый
    '<:aquadeer:751502091574313060>', # бирюзовый
)

alliance_emoji = (
    '🦅', # 🦅IMPERIUM OF MAN🦅
    '🌌', # 🌌CHAOS🌌
)
# ограничение максимального количества ролей (смена цвета ника) для пользователя
MAX_ROLES_PER_USER = 1
